Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Механизм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры/Ext/ManagerModule.bsl
Функция ПоПредставлениюCloud(Представление) Экспорт
	
	Результат = Перечисления.ВидыНоменклатуры.ПустаяСсылка();
	
	Если НРег(Представление) = НРег("MATERIAL") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Материал;
		
	ИначеЕсли НРег(Представление) = НРег("SERVICE") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Работа;
		
	ИначеЕсли НРег(Представление) = НРег("MECHANISM") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Механизм;
				
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестное представление'");
	
	КонецЕсли;	

	Возврат Результат;	
	
КонецФункции
